"use client";

import React, { useEffect } from "react";
import BlogPage from "./BlogPage";
import Navbar from "../Navbar/Navbar";

interface inf{
  id: number;
}
const BlogPages = (props: inf) => {
  const blogContents = [
    {
      title: `دسته‌بندی‌های اصلی هوش مصنوعی و کاربردهای آن`,
      text: `هوش مصنوعی موضوعی که امروزه توجه تمام دنیا را به خود جلب کرده و هر روز در حال توسعه و پیشرفت میباشد به گونه ای که اثرات آن در آینده نزدیک شیوه تمدن بشر را دستخوش تغییرات خواهد کرد. دسته بندی هوش مصنوعی به طورکلی به چند بخش اصلی تقسیم میشود:\n
1. هوش مصنوعی محدود
2. هوش مصنوعی عمومی
3. هوش مصنوعی فوق العاده
4. یادگیری ماشین
5. یادگیری عمیق
6. پردازش زبان طبیعی
7. بینایی ماشین
\nدر ادامه به توضیح هر یک خواهیم پرداخت.`,
      id: 1,
    },
    {
      title: `هوش مصنوعی: تعریف و طبقه‌بندی`,
      text: `تعریف کلی :
هوش مصنوعی به سیستم هایی اشاره دارد که میتواند از داده ها یاد بگیرند و تصمیم گیری کنند و به طور مستقل عمل کنند این تکنولوژی به سه دسته اصلی تقسیم میشود
1.هوش مصنوعی محدود: این نوع هوش مصنوعی برای انجام وظایف خاصی طراحی شده است که مفید و به منظور سهولت مورد استفاده قرار میگیرد مانند : دستیار های مجازی siri ،alexa ، chatgpt و ... . 
2.هوش مصنوعی عمومی : این نوع هوش مصنوعی قابلیت این را دارد که همانند انسان از محیط اطراف یاد بگیرد خود را توسعه دهد و بیاندیشد و تصمیم گیری کند که البته هنوز به طور کامل توسعه نیافته و بیشتر در حوزه نظری باقی مانده است.	
3.هوش مصنوعی فوق العاده : این نوع هوش مصنوعی فراتر از هوش انسانی عمل میکند و میتواند از انسان پیشی بگیرد این مفهوم بیشتر در داستان های علمی تخیلی می گنجد.
`,
      id:2,
    },
    {
      title: `یادگیری ماشین: معرفی و طبقه‌بندی روش‌ها`,
      text: `یادگیری ماشین : زیر مجموعه ای از هوش مصنوعی که به سیستم ها اجازه میدهد بدون برنامه نویسی صریح از داده ها یاد بگیرند  و پیشرفت کنند 
که شامل یک سری فرآیند اعم از : 1. جمع آوری داده ها 2. آموزش مدل  3.تست و ارزیابی 4. استفاده از مدل میباشد
و دسته بندی آنها به نحوه عملکرد به دو گروه : 1. با نظارت 2.بدون نظارت 3.نیمه نظارتی
با نظارت : شامل داده هایی که شامل یک برچسب به عنوان خروجی میباشد باید بر اساس الگوریتم های رگرسیون و طبقه بندی برچسب سایر داده بدست بیاید 
بدون نظارت : شامل داده هایی که برچسب ندارند و باید بر اساس الگوریتم های طبقه بندی در یک گروه قرار بگیرند
3. نیمه نظارتی : به آن دسته از داده هایی  که بخشی از آن نظارتی و بخشی از آن بدون ناظر باشد گویند. 
`,
      id: 3,
    },
    {
      title: `یادگیری عمیق: معرفی و کاربردها`,
      text: `یادگیری عمیق : زیر مجموعه از یادگیری ماشین که از شبکه عصبی عمیق برای پردازش داده ها استفاده میکند این روش در شناسایی تصویر و پردازش زبان طبیعی بسیار موثر است شبکه عصبی عمیق شامل چندین لایه پنهان که توانایی یادگیری الگوریتم های پیچیده را دارند. یادگیری عمیق به تعداد زیادی داده نیاز دارد تا بتواند به درستی آموزش ببیند و همچنین برای پردازش محاسبات سنگین آن به پردازنده با قدرت پردازش بالا نیاز دارد یادگیری عمیق در مباحثی همچون تشخیص چهره و ماشین ترجمه و خودرو های خودران بسیار موفق بوده است که به طور کلی به سه بخش تقسیم میشود:
 1.RNN (recurrent neural network)
 2. CNN(convelotional neural network)
 3. ANN (Artificial neural network)

`,
      id: 4,
    },
    {
      title: `پردازش زبان طبیعی: تکنیک‌ها و کاربردها`,
      text: `پردازش زبان طبیعی : شامل تکنیک ها و الگوریتم هایی است که به کامپیوتر ها کمک میکند تا متن و گفتار انسانی را درک کند و با آن ها تعامل داشته باشد این فرآیند ها شامل مراحل زیر است .
1. تحلیل متن :تحلیل و تجزیه ساختار معناشناسی جملات 
2.شناسایی موجودیت ها :شناسایی نام ها و مکان ها و تاریخ ها و دیگر اطلاعات مهم در متن 
3.تجزیه و تحلیل احساسات :تشخیص احساسات و نظرات در متن 
4.ترجمه ماشینی : تبدیل متن از یک زبان به زبان دیگر
چت بات ها و موتور های ترجمه و موتور های جستجو اطلاعات نمونه هایی از کاربرد هستند.
`,
      id: 5,
    },
  ];
  


  return (
    <div>
      <Navbar/>
      {blogContents.map(
        (content, i) => i == props.id-1 && <BlogPage blogInfo={content} />
      )}
    </div>
  );
};

export default BlogPages;
