
export const blogPosts = [
  {
  id: '1',
  imageSrc: "/DALL·E_2024_08_13_15_28_26_A_high_quality,_detailed_image_representing.png",
  title:"انواع هوش مصنوعی",   
  subtitle: `دسته‌بندی‌های اصلی هوش مصنوعی و کاربردهای آن`,
    description: `هوش مصنوعی موضوعی که امروزه توجه تمام دنیا را به خود جلب کرده و هر روز در حال توسعه و پیشرفت میباشد به گونه ای که اثرات آن در آینده نزدیک شیوه تمدن بشر را دستخوش تغییرات خواهد کرد. دسته بندی هوش مصنوعی به طورکلی به چند بخش اصلی تقسیم میشود:\n
1. هوش مصنوعی محدود
2. هوش مصنوعی عمومی
3. هوش مصنوعی فوق العاده
4. یادگیری ماشین
5. یادگیری عمیق
6. پردازش زبان طبیعی
7. بینایی ماشین
\nدر ادامه به توضیح هر یک خواهیم پرداخت.`,
    link: '/posts/ai-automated-calls',
    date: 'شهریور ۱, ۱۴۰۳'
  },
  {
    id: '2',
    imageSrc: "/DALL·E_2024_08_13_15_32_02_A_high_quality,_detailed_image_representing.png",
    title:"هوش مصنوعی چیست؟",   
    subtitle: `هوش مصنوعی: تعریف و طبقه‌بندی`,
    description: `تعریف کلی :
    هوش مصنوعی به سیستم هایی اشاره دارد که میتواند از داده ها یاد بگیرند و تصمیم گیری کنند و به طور مستقل عمل کنند این تکنولوژی به سه دسته اصلی تقسیم میشود
    1.هوش مصنوعی محدود: این نوع هوش مصنوعی برای انجام وظایف خاصی طراحی شده است که مفید و به منظور سهولت مورد استفاده قرار میگیرد مانند : دستیار های مجازی siri ،alexa ، chatgpt و ... . 
    2.هوش مصنوعی عمومی : این نوع هوش مصنوعی قابلیت این را دارد که همانند انسان از محیط اطراف یاد بگیرد خود را توسعه دهد و بیاندیشد و تصمیم گیری کند که البته هنوز به طور کامل توسعه نیافته و بیشتر در حوزه نظری باقی مانده است.	
    3.هوش مصنوعی فوق العاده : این نوع هوش مصنوعی فراتر از هوش انسانی عمل میکند و میتواند از انسان پیشی بگیرد این مفهوم بیشتر در داستان های علمی تخیلی می گنجد.
    `,
    link: '/posts/intelligent-call-routing',
    date: 'شهریور ۸, ۱۴۰۳'
  },
  {
    id: '3',
    imageSrc: "/DALL·E_2024_08_13_15_29_09_A_high_quality,_artistic_image_representing.png",
    title:"یادگیری ماشین", 
    subtitle: `معرفی و طبقه‌بندی روش‌ها`,
    description:`یادگیری ماشین : زیر مجموعه ای از هوش مصنوعی که به سیستم ها اجازه میدهد بدون برنامه نویسی صریح از داده ها یاد بگیرند  و پیشرفت کنند 
که شامل یک سری فرآیند اعم از : 1. جمع آوری داده ها 2. آموزش مدل  3.تست و ارزیابی 4. استفاده از مدل میباشد
و دسته بندی آنها به نحوه عملکرد به دو گروه : 1. با نظارت 2.بدون نظارت 3.نیمه نظارتی
با نظارت : شامل داده هایی که شامل یک برچسب به عنوان خروجی میباشد باید بر اساس الگوریتم های رگرسیون و طبقه بندی برچسب سایر داده بدست بیاید 
بدون نظارت : شامل داده هایی که برچسب ندارند و باید بر اساس الگوریتم های طبقه بندی در یک گروه قرار بگیرند
3. نیمه نظارتی : به آن دسته از داده هایی  که بخشی از آن نظارتی و بخشی از آن بدون ناظر باشد گویند. 
`,
    link: '/posts/text-to-speech-tech',
    date: 'شهریور ۱۵, ۱۴۰۳'
  },
  {
    id: '4',
    title:"یادگیری عمیق",
    subtitle: `معرفی و کاربردهای یادگیری عمیق`,
    imageSrc: "/DALL·E_2024_08_13_15_26_14_A_high_quality,_detailed_image_representing.png",
    description: 'Opera به عنوان یک محصول پیشرفته در زمینه هوش مصنوعی، به شما این امکان را می‌دهد که با استفاده از موتور هوش مصنوعی به طور مستقیم با مشتریان تعامل داشته باشید. این سرویس به شما کمک می‌کند تا با بهبود فرآیندهای ارتباطی، تجربه مشتری را بهبود بخشید.',
    link: '/posts/smart-inquiry-service',
    date: 'شهریور ۲۲, ۱۴۰۳'
  },

  {
    id: '5',
    title:"پردازش زبان طبیعی",
    subtitle: `تکنیک‌ها و کاربردهای پردازش زبان طبیعی`,
    imageSrc: "/DALL·E_2024_08_13_15_26_42_A_high_quality,_artistic_image_representing.png",
    description: `پردازش زبان طبیعی : شامل تکنیک ها و الگوریتم هایی است که به کامپیوتر ها کمک میکند تا متن و گفتار انسانی را درک کند و با آن ها تعامل داشته باشد این فرآیند ها شامل مراحل زیر است .
1. تحلیل متن :تحلیل و تجزیه ساختار معناشناسی جملات 
2.شناسایی موجودیت ها :شناسایی نام ها و مکان ها و تاریخ ها و دیگر اطلاعات مهم در متن 
3.تجزیه و تحلیل احساسات :تشخیص احساسات و نظرات در متن 
4.ترجمه ماشینی : تبدیل متن از یک زبان به زبان دیگر
چت بات ها و موتور های ترجمه و موتور های جستجو اطلاعات نمونه هایی از کاربرد هستند.
`,
    link: '/posts/smart-inquiry-service',
    date: 'شهریور ۲۲, ۱۴۰۳'
  },

  {
    id: '6',
    title:"پردازش زبان طبیعی",
    subtitle: `تکنیک‌ها و کاربردهای پردازش زبان طبیعی`,
    imageSrc: "/DALL·E_2024_08_13_15_28_41_A_high_quality,_artistic_image_representing.png",
    description: `پردازش زبان طبیعی : شامل تکنیک ها و الگوریتم هایی است که به کامپیوتر ها کمک میکند تا متن و گفتار انسانی را درک کند و با آن ها تعامل داشته باشد این فرآیند ها شامل مراحل زیر است .
1. تحلیل متن :تحلیل و تجزیه ساختار معناشناسی جملات 
2.شناسایی موجودیت ها :شناسایی نام ها و مکان ها و تاریخ ها و دیگر اطلاعات مهم در متن 
3.تجزیه و تحلیل احساسات :تشخیص احساسات و نظرات در متن 
4.ترجمه ماشینی : تبدیل متن از یک زبان به زبان دیگر
چت بات ها و موتور های ترجمه و موتور های جستجو اطلاعات نمونه هایی از کاربرد هستند.
`,
    link: '/posts/smart-inquiry-service',
    date: 'شهریور ۲۲, ۱۴۰۳'
  }

];
